[
  {
    "id": 1,
    "service_details": {
      "title": "Alloy Wheel Restoration & Refurbishment – Bring Your Wheels Back to Life",
      "description": "Over time, alloy wheels can lose their shine due to kerb damage, scratches, corrosion, or general wear and tear. Alloy wheel restoration (or refurbishment) is the process of repairing and refinishing your wheels to make them look as good as new—often at a fraction of the cost of buying replacements. At The Wheel Master, we use industry-leading equipment, premium materials, and skilled craftsmanship to restore your wheels to factory-fresh condition or even give them a custom new look.",

      "services": [
        {
          "title": "Wheel Straightening",
          "description": "Bent rims not only hurt aesthetics but can compromise safety, affecting tire life, fuel efficiency, and steering precision. Our precision straightening process restores both form and performance."
        },
        {
          "title": "Cosmetic Repairs",
          "description": "Minor curbing or scratches? Our cosmetic repair techniques focus on minimizing treatment area to reduce cost and time—without compromising quality."
        },
        {
          "title": "Complete Refurbishment",
          "description": "For wheels with deeper damage, metal loss, or coating wear, we perform full refurbishment: strip, wet blast, repair, prime, paint, clear coat—bringing back manufacturer-quality finish. Average turnaround: 3 working days, extended if structural repairs are needed after inspection."
        },
        {
          "title": "Diamond Cutting",
          "description": "Achieve that premium, reflective finish only possible via precise lathing. Note: diamond-cut surfaces can only be redone a limited number of times."
        },
        {
          "title": "Wheel Personalization",
          "description": "Upgrade your look with color-matched wheels, custom tones, finishes, pinstriping, or detailed wheel pockets."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Assessment & Quote",
        "description": "We examine your wheel for structural issues, damage, or suitability for refurbishment.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Detailed Process",
        "description": "Removing tires, weights, decals — followed by stripping, blasting, repairing, painting, coating, balancing, and final inspection.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      },
      {
        "id": 3,
        "title": "Delivery or Pickup",
        "description": "Quick turnaround (typically within 3 days). We offer pickup/drop-off for corporate clients for added convenience.",
        "icon": "/assets/img/icon/service-icon-3.svg"
      }
    ]
  },
  {
    "id": 2,
    "service_details": {
      "title": "Crack or Bend Repair",
      "description": "At The Wheel Master, we specialize in professional alloy wheel crack and bend repairs, ensuring your wheels are structurally sound, safe, and road-ready. Damaged wheels not only spoil the look of your vehicle but also pose serious safety risks—impacting handling, tire wear, and even fuel efficiency. Our expert team uses advanced repair techniques and state-of-the-art equipment to restore your wheels back to perfect condition.",
      "services": [
        {
          "title": "Inspection & Diagnosis",
          "description": "Every wheel undergoes a thorough inspection to identify the severity of cracks, bends, or buckles."
        },
        {
          "title": "Straightening",
          "description": "Using specialist hydraulic and heat treatment equipment, we carefully straighten bent rims while maintaining structural integrity."
        },
        {
          "title": "Crack Welding & Reinforcement",
          "description": "Cracks are welded using high-quality materials and precision techniques to restore strength."
        },
        {
          "title": "Refinishing (Optional)",
          "description": "After the repair, we can blend the treated area with cosmetic refurbishment or a complete respray for a flawless finish."
        },
        {
          "title": "Final Safety Check",
          "description": "Each wheel is balanced, aligned, and checked against safety standards before being returned to you."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Enhanced Safety",
        "description": "Cracks or bends compromise the structural integrity of your wheels, risking blowouts or poor handling.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Cost-Effective Solution",
        "description": "Repairing a cracked or bent wheel is far more affordable than replacing it.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      },
      {
        "id": 3,
        "title": "Eco-Friendly Choice",
        "description": "Extends the life of your existing wheels, reducing waste.",
        "icon": "/assets/img/icon/service-icon-3.svg"
      }
    ]
  },
  {
    "id": 3,
    "service_details": {
      "title": "CNC Diamond Finish - The Ultimate Premium Alloy Wheel Look",
      "description": "At The Wheel Master, we specialize in delivering the flawless CNC Diamond Cut Finish—a premium treatment that gives your alloy wheels a sleek, polished, and high-end appearance. Using advanced CNC (Computer Numerical Control) lathes, our skilled technicians achieve a highly reflective, precision-cut surface that makes your wheels look as good as (or better than) new.",
      "services": [
        {
          "title": "Wheel Preparation",
          "description": "Tyres, weights, and valves are removed before stripping and cleaning."
        },
        {
          "title": "Initial Inspection",
          "description": "Wheels are checked for bends, cracks, or damage (repaired if necessary)."
        },
        {
          "title": "CNC Lathe Cutting",
          "description": "A thin surface layer is removed with precision diamond-tipped tools."
        },
        {
          "title": "Protective Coating",
          "description": "A durable clear coat is applied to preserve the shine and guard against corrosion."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Showroom-Quality Shine",
        "description": "Achieves a finish comparable to brand-new premium wheels.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Unique Aesthetic",
        "description": "Distinctive two-tone or polished-metal effect for a luxurious style.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      },
      {
        "id": 3,
        "title": "Precision Workmanship",
        "description": "Advanced CNC lathes ensure millimeter-perfect accuracy.",
        "icon": "/assets/img/icon/service-icon-3.svg"
      }
    ]
  },
  {
    "id": 4,
    "service_details": {
      "title": "Wheel Straightening - Restoring Balance. Restoring Safety",
      "description": "At The Wheel Master, we offer professional alloy wheel straightening services to repair bent, buckled, or distorted wheels. Even a slight bend in your rim can cause vibrations, uneven tire wear, poor handling, and—most importantly—compromise your safety on the road. Our expert technicians use specialized hydraulic and heat treatment equipment to restore your wheels to their original shape, ensuring smooth performance and long-term durability.",
      "services": [
        {
          "title": "Inspection & Diagnosis",
          "description": "Each wheel is thoroughly examined to identify flat spots, buckles, or out-of-round areas."
        },
        {
          "title": "Precision Straightening",
          "description": "Using advanced hydraulic rollers and heat treatment (where required), we gently restore the wheel to its factory shape without compromising structural integrity."
        },
        {
          "title": "Safety Verification",
          "description": "Every repaired wheel is tested for balance, roundness, and strength to ensure it meets road safety standards."
        },
        {
          "title": "Optional Refinishing",
          "description": "If your wheel also has scratches, corrosion, or cosmetic damage, we can combine straightening with refurbishment for a complete restoration."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Improved Safety",
        "description": "A bent wheel can lead to unpredictable handling, tire blowouts, or braking issues.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Cost Savings",
        "description": "Repairing your wheel is far more affordable than replacing it.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      },
      {
        "id": 3,
        "title": "Extended Tire Life",
        "description": "Straight wheels ensure even tire wear, saving you money in the long run.",
        "icon": "/assets/img/icon/service-icon-3.svg"
      }
    ]
  },
  {
    "id": 5,
    "service_details": {
      "title": "Cosmetic Repair - Small Damage. Big Difference.",
      "description": "At The Wheel Master, we specialize in quick and effective cosmetic alloy wheel repairs that restore your wheels to a near-perfect condition without the need for full refurbishment. From light scuffs and scratches to minor curb rash, our cosmetic repair service is designed to save you time and money while keeping your wheels looking sharp.",
      "services": [
        {
          "title": "Damage Assessment",
          "description": "We inspect the wheel to confirm if cosmetic repair is suitable (for light to moderate surface damage)."
        },
        {
          "title": "Surface Preparation",
          "description": "The damaged area is cleaned, sanded, and primed to ensure smooth application."
        },
        {
          "title": "Paint & Color Matching",
          "description": "Using precision color-matching techniques, we repaint the affected area to blend seamlessly with the existing wheel finish."
        },
        {
          "title": "Clear Coat Application",
          "description": "A protective lacquer is applied to restore shine and shield against future wear."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Fast Turnaround",
        "description": "Most cosmetic jobs are completed within a few hours.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Cost-Effective",
        "description": "Only the affected area is treated, so you avoid the cost of a full refurbishment.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      },
      {
        "id": 3,
        "title": "Like-New Finish",
        "description": "Scuffs, chips, and scratches are seamlessly blended with the rest of the wheel.",
        "icon": "/assets/img/icon/service-icon-3.svg"
      }
    ]
  },
  {
    "id": 6,
    "service_details": {
      "title": "Wheel Personalization - Make Your Wheels Truly Yours",
      "description": "At The Wheel Master, we offer wheel personalization services to help you express your style while maintaining performance and safety. From custom colors to unique finishes, pinstriping, and specialized coatings, our expert team transforms your wheels into a statement of individuality.",
      "services": [
        {
          "title": "Consultation & Design",
          "description": "Discuss your vision and select colors, finishes, or designs."
        },
        {
          "title": "Surface Preparation",
          "description": "Wheels are cleaned, stripped, and primed for the perfect finish."
        },
        {
          "title": "Application",
          "description": "Paints, coatings, and designs are applied with precision."
        },
        {
          "title": "Curing & Finishing",
          "description": "Layers are baked or cured for durability, then polished to perfection."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Custom Colors & Finishes",
        "description": "Choose from a wide range of colors, metallics, or matte finishes. Our color-matching technology ensures your wheels achieve the exact shade you want.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Pinstriping & Design Accents",
        "description": "Add subtle or bold lines, logos, or patterns for a personalized touch that makes your wheels one-of-a-kind.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      },
      {
        "id": 3,
        "title": "Two-Tone & Multi-Finish Wheels",
        "description": "Combine finishes like gloss and matte, or diamond-cut faces with painted interiors, for a premium, eye-catching effect.",
        "icon": "/assets/img/icon/service-icon-3.svg"
      }
    ]
  },
  {
    "id": 7,
    "service_details": {
      "title": "Wheel Alignment & Balancing - Drive Smooth. Drive Safe.",
      "description": "At The Wheel Master, we provide professional wheel alignment and balancing services to ensure your vehicle runs smoothly, safely, and efficiently. Misaligned or unbalanced wheels don’t just affect comfort—they reduce fuel efficiency, cause uneven tire wear, and compromise handling. Our expert team uses advanced alignment systems and precision balancing equipment to restore your car’s performance.",
      "services": [
        {
          "title": "Inspection",
          "description": "Checking tires, suspension, and wheel condition."
        },
        {
          "title": "Computerized Alignment",
          "description": "Using advanced equipment for millimeter-perfect adjustments."
        },
        {
          "title": "Precision Balancing",
          "description": "Adding calibrated weights to balance wheel and tire assemblies."
        },
        {
          "title": "Final Test",
          "description": "Road test or spin balancing to ensure accuracy and performance."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Wheel Alignment",
        "description": "We adjust your vehicle’s wheel angles—camber, caster, and toe—to meet manufacturer specifications. This ensures the wheels are perfectly aligned with each other and the road.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Wheel Balancing",
        "description": "Weights are carefully added to correct any imbalance in your wheels and tires, ensuring even weight distribution for a smooth, vibration-free ride.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      }
    ]
  },
  {
    "id": 9,
    "service_details": {
      "title": "Alloy Wheel Health Check-Up and Service",
      "description": "Your alloy wheels go through a lot on the road — from potholes and bumps to daily wear and tear. Even if your wheels look fine on the outside, hidden issues like minor cracks, bends, or alignment problems can compromise safety, reduce performance, and shorten the lifespan of your alloys. Our Alloy Wheel Health Check-Up and Service is designed to detect problems early and keep your wheels in top condition.",
      "services": [
        {
          "title": "Structural Integrity",
          "description": "Detecting cracks, bends, or fractures."
        },
        {
          "title": "Wheel Alignment & Balance",
          "description": "Ensuring proper stability and driving comfort."
        },
        {
          "title": "Surface Condition",
          "description": "Identifying scratches, scuffs, or corrosion."
        },
        {
          "title": "Tyre-Wheel Fit",
          "description": "Checking for proper sealing and air leaks."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Safety First",
        "description": "Small cracks or hidden damage can lead to dangerous wheel failures if left untreated.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Prevent Costly Repairs",
        "description": "Early detection helps avoid extensive refurbishments or replacements.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      },
      {
        "id": 3,
        "title": "Improved Performance",
        "description": "Ensures your car runs smoothly with proper balance and alignment.",
        "icon": "/assets/img/icon/service-icon-3.svg"
      }
    ]
  },
  {
    "id": 8,
    "service_details": {
      "title": "Brake Caliper Painting",
      "description": "Your wheels deserve more than just performance – they deserve style. At The Wheel Master, we offer professional Brake Caliper Painting services that give your vehicle a sporty, premium, and customized look while also protecting your calipers from dust, rust, and corrosion.",
      "services": [
        {
          "title": "Thorough Cleaning",
          "description": "We start by carefully cleaning and preparing your brake calipers to remove dirt, grease, and rust."
        },
        {
          "title": "Masking & Protection",
          "description": "All surrounding areas are masked to prevent overspray, ensuring a clean finish."
        },
        {
          "title": "Premium Heat-Resistant Paint",
          "description": "We use high-quality, heat-resistant paints that withstand extreme temperatures and maintain their shine."
        },
        {
          "title": "Custom Finish Options",
          "description": "Choose from a wide range of colors and finishes, from glossy red and metallic gold to matte black or custom shades."
        }
      ]
    },
    "similar_services": [
      {
        "id": 1,
        "title": "Enhanced Aesthetics",
        "description": "Brake caliper painting instantly upgrades the visual appeal of your wheels, giving your car a sportier, premium look.",
        "icon": "/assets/img/icon/service-icon-1.svg"
      },
      {
        "id": 2,
        "title": "Corrosion Protection",
        "description": "The specialized high-heat paint protects calipers from rust, dirt, and road grime, increasing their lifespan.",
        "icon": "/assets/img/icon/service-icon-2.svg"
      },
      {
        "id": 3,
        "title": "Customization",
        "description": "You can personalize your car’s style with colors that match or contrast your wheels, making your vehicle stand out.",
        "icon": "/assets/img/icon/service-icon-3.svg"
      }
    ]
  }
]
